title: Multiple Suspicious Resp Codes Caused by Single Client
description: Detects possible exploitation activity or bugs in a web application
level: medium
tags:
- attack.initial_access
- attack.t1190
logsource:
  category: web
detection:
  selection:
    sc-status:
    - 400
    - 401
    - 403
    - 500
  timeframe: 10m
  condition: selection | count() by clientip > 10
fields:
- client_ip
- vhost
- url
- response
falsepositives:
- Unstable application
- Application that misuses the response codes

